<?php
// +----------------------------------------------------------------------------
// | 描述：用户检测
// +----------------------------------------------------------------------------
// | 作者：度月飞天 490702087@qq.com
// +----------------------------------------------------------------------------
// | 版权：Copyright (c) 2015 www.keebin.cn All rights reserved.
// +----------------------------------------------------------------------------
// | 日期：2015-2-10 下午8:31:33
// +----------------------------------------------------------------------------


namespace Home\Controller;
use Think\Controller;

class AuthController extends Controller {
	/**
	 * 后台控制器初始化
	 */
	protected function _initialize(){
		// 获取当前用户ID
		if(defined('UID')) return ;
		define('UID',is_login());
		if( !UID ){// 还没登录 跳转到登录页面
			$this->redirect('Public/login');
		}
	}
}